caso_teste/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
 inletGeo
{
    type            codedFixedValue;
    value           uniform (0 0 0);
    name            inletVelocityPulseParabolic;
    code            #{
        const scalar t = this->db().time().value();
        const fvPatch& patch = this->patch();
        const vectorField& Cf = patch.Cf(); 
        
        // CORREÇÃO 1: Instanciação direta criando uma cópia do tmp<vectorField>
        // Isso evita o erro de dangling reference
        const vectorField nf(patch.nf()); 

        // ===== 1. Parâmetros Fisiológicos (Ondas E e A) =====
        const scalar T = 1.0; 
        const scalar tau = fmod(t, T);
        const scalar Q_amp = 4.6e-05;

        const scalar tE = 0.45, sigmaE = 0.05, aE = 1.0;  
        const scalar tA = 0.85, sigmaA = 0.05, aA = 0.5;  

        scalar E_wave = aE * exp(-sqr((tau - tE) / (sigmaE * sqrt(2.0))));
        scalar A_wave = aA * exp(-sqr((tau - tA) / (sigmaA * sqrt(2.0))));
        
        scalar Q_t = Q_amp * (E_wave + A_wave);

        // ===== 2. Cálculos Geométricos Estáticos =====
        static scalar A_inlet = gSum(patch.magSf());
        static vector patchCenter = gSum(Cf * patch.magSf()) / A_inlet;
        static scalar R = sqrt(A_inlet / constant::mathematical::pi);

        // ===== 3. Cálculo da Velocidade =====
        scalar U_mean = max(Q_t / A_inlet, 0.0);
        scalar U_max = 2.0 * U_mean; 

        if (t < T) 
        
        {
            Info<< "Time:" << t 
                << " | Area:" << A_inlet 
                << " | Q:" << Q_t 
                << " | U_mean:" << U_mean << endl;
        }        

        vectorField U_patch(patch.size(), vector::zero);

        // ===== 4. Distribuição Parabólica =====
        forAll(Cf, faceI)
        {
            scalar r = mag(Cf[faceI] - patchCenter);
            
            if (r > R) 
            {
                r = R;
            }

            scalar u_local = U_max * (1.0 - sqr(r / R));

            U_patch[faceI] = -nf[faceI] * u_local;
        }

        this->operator==(U_patch);

        // CORREÇÃO 2: Uso do método writeTime() em vez de outputTime()
        if (this->db().time().writeTime())
        {
            Info<< "CFD Pulse - Q_t: " << Q_t 
                << " | U_max: " << U_max << " m/s" << endl;
        }
    #};
}
    outletGeo
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    wallsGeo
    {
        type            noSlip;
    }
    mitralRingWallGeo
    {
        type            noSlip;
    }
    mitralABodyGeo
    {
        type            noSlip;
    }
    mitralBBodyGeo
    {
        type            noSlip;
    }
}


// ************************************************************************* //
