caso_teste/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    inletGeo
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    outletGeo
    {
        type            zeroGradient;
    }
    wallsGeo
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    mitralRingWallGeo
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    mitralABodyGeo
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    mitralBBodyGeo
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
}


// ************************************************************************* //
