caso_teste/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1e-10;

boundaryField
{
    inletGeo
    {
        type            codedFixedValue;
        name            inletTurbulentK;
        value           uniform 1e-10;
        code            #{
            const fvPatch& patch = this->patch();
            const scalar t = this->db().time().value();

            const scalar freq = 1.0;
            const scalar T = 1.0 / freq;
            const scalar Q_amp = 2.67e-05;

            const scalar tau = fmod(t, T);
            const scalar tE = 0.2 * T;
            const scalar tA = 0.8 * T;
            const scalar sigmaE = 0.05 * T;
            const scalar sigmaA = 0.05 * T;

            const scalar aE = 1.0;
            const scalar aA = 0.5;

            scalar E_wave = aE * exp(-pow((tau - tE) / (sigmaE * sqrt(2.0)), 2));
            scalar A_wave = aA * exp(-pow((tau - tA) / (sigmaA * sqrt(2.0)), 2));
            scalar Q_t = Q_amp * (E_wave + A_wave);

            scalar A_inlet = gSum(patch.magSf());

            scalar U_mean = 0.0;
            if (A_inlet > VSMALL)
            {
                U_mean = Q_t / A_inlet;
            }

            U_mean = max(U_mean, 1e-5); 

            const scalar I = 0.02; 

            scalar k_val = 1.5 * pow(U_mean * I, 2.0);
            k_val = max(k_val, 1e-12); 

            operator==(k_val);
        #};
    }
    outletGeo
    {
        type            zeroGradient;
    }
    wallsGeo
    {
        type            kqRWallFunction;
        value           uniform 1e-10;
    }
    mitralRingWallGeo
    {
        type            kqRWallFunction;
        value           uniform 1e-10;
    }
    mitralABodyGeo
    {
        type            kqRWallFunction;
        value           uniform 1e-10;
    }
    mitralBBodyGeo
    {
        type            kqRWallFunction;
        value           uniform 1e-10;
    }
}

// ************************************************************************* //
