caso_teste/Allrun
cd ${0%/*} || exit 1    

rm -r processor*

decomposePar

rm log.*

. $WM_PROJECT_DIR/bin/tools/RunFunctions



runParallel $(getApplication)