caso_teste/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM: The Open Source CFD Toolbox                                      |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
    model           WALE;
    turbulence      on;
    printCoeffs     on;

    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff  1;
    }

    WALECoeffs
    {
        Ck          0.094;
        Cw          0.325;
    }
}

// ************************************************************************* //
