caso_teste/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

xmin -0.038387;
xmax  0.038387;
ymin -0.033905;
ymax  0.033905;
zmin -0.005000;
zmax  0.100505;

// Base mesh resolution tuned for LES with snappy refinement capped at 500k cells.
dx 0.0018;
dy 0.0018;
dz 0.0018;

lx #calc "$xmax - $xmin";
ly #calc "$ymax - $ymin";
lz #calc "$zmax - $zmin";

xcells #calc "round(abs($lx / $dx))";
ycells #calc "round(abs($ly / $dy))";
zcells #calc "round(abs($lz / $dz))";

vertices
(
    ($xmin  $ymin  $zmin)
    ($xmax  $ymin  $zmin)
    ($xmax  $ymax  $zmin)
    ($xmin  $ymax  $zmin)
    ($xmin  $ymin  $zmax)
    ($xmax  $ymin  $zmax)
    ($xmax  $ymax  $zmax)
    ($xmin  $ymax  $zmax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    minX
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    maxX
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    minY
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    maxY
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    minZ
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    maxZ
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
