caso_teste/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

// ************************************************************************* //

application     foamRun;
solver     incompressibleFluid;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         30;
deltaT          1e-5;

writeControl    adjustableRunTime;
writeInterval   0.01;
purgeWrite      0;
writeFormat     binary;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo          0.5;

// ************************************************************************* //

functions
{

///////////////////////////////////////////////////////////////////////////

minmaxdomain_scalar
{
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");

    enabled 	    true; 	//true or false
    log             true;	//write to screen
    
    //writeControl    writeTime;
    writeControl    timeStep;
    writeInterval   1;

    writeFields     false;	//write solution to field value - Not needed when only reporting value to screen

    writeLocation   true;	//write location in the output file

    //mode component;

    select      all;

    operation       none;

    fields
    (
        p 
        k 
        omega 
        nut
    );
}

minmaxdomain_vector
{
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");

    enabled 	    true; 	//true or false
    log             true;	//write to screen
    
    //writeControl    writeTime;
    writeControl    timeStep;
    writeInterval   1;

    writeFields     false;	//write solution to field value - Not needed when only reporting value to screen

    writeLocation   true;	//write location in the output file

    //mode component;

    select      all;

    operation       none;

    fields
    (
        U
    );
}

mindomain_scalar
{
    $minmaxdomain_scalar
    operation       min;
}

mindomain_vector
{
    $minmaxdomain_vector
    operation       minMag;
}

maxdomain_scalar
{
    $minmaxdomain_scalar
    operation       max;
}

maxdomain_vector
{
    $minmaxdomain_vector
    operation       maxMag;
}

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
//Saves yplus field at the given interval

    yplus_field
    {
        type yPlus;
        libs ("libutilityFunctionObjects.so");

        enabled true;
        //log false;

        writeControl outputTime;
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
//Print y+ stats every iteration without saving the field

    yplus_stats
    {
        type yPlus;
        libs ("libutilityFunctionObjects.so");

        enabled true;

        writeControl timeStep;
        writeInterval 1;

//Leave object empty to not save the field
//This will only print the yplus values every timestep and will not save the field
        objects ();
        log true;
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

wallShearStress1
{
    type                wallShearStress;
    functionObjectLibs  ("libutilityFunctionObjects.so");

    enabled true;

    writeControl outputTime;
    //writeControl timeStep;
    //writeInterval 1;

    //log true;
}

    Q_criterion
    {
        type            Q;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl    writeTime; // Grava junto com os arquivos de tempo (0.2s)
        log             false;
    }

    vorticityField
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl    writeTime;
        log             false;
    }

///////////////////////////////////////////////////////////////////////////

}





functions
{
    // =========================================================================
    // NOVO: CALCULO DE VORTICIDADE E Q-CRITERION (Para Visualizacao Bonita)
    // Isso gera os campos 'Q' e 'vorticity' para voce abrir no Paraview
    // =========================================================================
    




    // =========================================================================
    // SUAS FUNCOES ORIGINAIS (MANTIDAS)
    // =========================================================================

    // 1. MONITORAMENTO DE ESTABILIDADE
    minmaxdomain_scalar
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        log             true;
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        writeLocation   true;
        select          all;
        operation       none;
        fields          ( p nut );
    }

    minmaxdomain_vector
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        log             true;
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        writeLocation   true;
        select          all;
        operation       none;
        fields          ( U );
    }

    mindomain_scalar { $minmaxdomain_scalar operation min; }
    maxdomain_scalar { $minmaxdomain_scalar operation max; }
    maxdomain_vector { $minmaxdomain_vector operation maxMag; }

    // 3. Y PLUS
    yplus_stats
    {
        type            yPlus;
        libs            ("libutilityFunctionObjects.so");
        enabled         true;
        writeControl    timeStep;
        writeInterval   1;
        objects         ();
        log             true;
    }

}

