caso_teste/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12                                	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;

sourceCase ".";
sourcePatches (back);

exposedPatchName front;

flipNormals false;

extrudeModel        linearNormal;

nLayers             1;

linearNormalCoeffs
{
    thickness       0.001;
}

mergeFaces false;  

// Merge small edges. Fraction of bounding box.
//mergeTol 0;
