caso_teste/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12                                 	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxNonOrtho 75;
maxBoundarySkewness 4;	//Original 20 for better quality 4
maxInternalSkewness 4;

//- Maximum non-orthogonality allowed. Set to 180 to disable.
//- Max skewness allowed. Set to <0 to disable.
/*
maxNonOrtho 180;
maxBoundarySkewness -1;	
maxInternalSkewness -1;
*/


maxConcave 80;

//minVol 1e-13;
minVol -1e30;

minTetQuality -1e+30;

minTwist 0.02;  //0.01;

minDeterminant 0.001;	//0.001

minFaceWeight 0.05;

minVolRatio 0.01;


//- not used anymore
minArea -1x;              //apparently not used
minTriangleTwist -1x;     //apparently not used
minFlatness 0.5x;         //apparently not used


// ************************************************************************* //
