caso_teste/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         |
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}

interpolationScheme cellPoint;

sets
(
    inletArea
    {
        type patch;
        patch inlet;
    }
);