caso_teste/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    inletGeo
    {
        type triSurfaceMesh;
        file "inlet.stl";
    }

    outletGeo
    {
        type triSurfaceMesh;
        file "outlet.stl";
    }

    wallsGeo
    {
        type triSurfaceMesh;
        file "walls.stl";
    }

    mitralABodyGeo
    {
        type triSurfaceMesh;
        file "mitralA_body.stl";
    }

    mitralBBodyGeo
    {
        type triSurfaceMesh;
        file "mitralB_body.stl";
    }

    mitralRingWallGeo
    {
        type triSurfaceMesh;
        file "mitralRingWall.stl";
    }

    leftStructuredBox
    {
        type searchableBox;
        min (-0.020 -0.012 0.040);
        max (-0.004  0.012 0.072);
    }

    rightStructuredBox
    {
        type searchableBox;
        min (0.004 -0.012 0.040);
        max (0.020  0.012 0.072);
    }

    apexRefineBox
    {
        type searchableBox;
        min (-0.014 -0.014 0.002);
        max ( 0.014  0.014 0.014);
    }
}

castellatedMeshControls
{
    maxLocalCells 250000;
    maxGlobalCells 500000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    resolveFeatureAngle 30;

    allowFreeStandingZoneFaces true;

    features
    (
        { file "inlet.extendedFeatureEdgeMesh";  level 2; }
        { file "outlet.extendedFeatureEdgeMesh"; level 2; }
        { file "walls.extendedFeatureEdgeMesh";  level 2; }
    );

    refinementSurfaces
    {
        inletGeo
        {
            level (1 1);
            patchInfo { type patch; }
        }

        outletGeo
        {
            level (1 1);
            patchInfo { type patch; }
        }

        wallsGeo
        {
            level (2 2);
            patchInfo { type wall; }
        }

        mitralABodyGeo
        {
            level (2 2);
            patchInfo { type wall; }
        }

        mitralBBodyGeo
        {
            level (2 2);
            patchInfo { type wall; }
        }

        mitralRingWallGeo
        {
            level (2 2);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        leftStructuredBox
        {
            mode inside;
            levels ((1E15 2));
        }

        rightStructuredBox
        {
            mode inside;
            levels ((1E15 2));
        }

        apexRefineBox
        {
            mode inside;
            levels ((1E15 2));
        }
    }

    // Keep both top boxes as uniform as possible by capping local cell level.
    limitRegions
    {
        leftStructuredBox
        {
            mode inside;
            levels ((1E15 2));
        }

        rightStructuredBox
        {
            mode inside;
            levels ((1E15 2));
        }
    }

    locationInMesh (0.000000 0.000000 0.047752);
}

snapControls
{
    nSmoothPatch 5;
    tolerance 2.0;
    nSolveIter 50;
    nRelaxIter 10;
    nFeatureSnapIter 15;

    implicitFeatureSnap true;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
        wallsGeo
        {
            nSurfaceLayers 8;
        }
        mitralABodyGeo
        {
            nSurfaceLayers 4;
        }
        mitralBBodyGeo
        {
            nSurfaceLayers 4;
        }
        mitralRingWallGeo
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio 1.2;
    firstLayerThickness 0.1;
    minThickness 0.001;
    nGrow 0;

    featureAngle 130;
    slipFeatureAngle 30;

    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 1.0;

    minMedialAxisAngle 90;
    nMedialAxisIter 10;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;
    nRelaxedIter 20;
    nRelaxIter 5;
}

meshQualityControls
{
    #include "meshQualityDict"

    nSmoothScale 4;
    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}

mergeTolerance 1e-6;

// ************************************************************************* //
